garyPenhook/PyAvrOCD/svd/attiny45.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC1</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x00800043</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DT1A</name>
          <description>Dead time value register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTVL</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTVH</name>
              <description>No Description.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DT1B</name>
          <description>Dead time value B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTVL</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTVH</name>
              <description>No Description.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DTPS</name>
          <description>Dead time prescaler register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTPS</name>
              <description>No Description.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GTCCR</name>
          <description>Timer counter control register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSR1</name>
              <description>Prescaler Reset Timer/Counter1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC1A</name>
              <description>Force Output Compare 1A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC1B</name>
              <description>Force Output Compare Match 1B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COM1B</name>
              <description>Comparator B Output Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM1B</name>
              <description>Pulse Width Modulator B Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR1A</name>
          <description>Output Compare Register</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1B</name>
          <description>Output Compare Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1C</name>
          <description>Output compare register</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR1</name>
          <description>Timer/Counter Control Register</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS1</name>
              <description>Clock Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_STOPPED</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_NO_PRESCALING</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_2</name>
                  <description>Running, CLK/2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_4</name>
                  <description>Running, CLK/4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_8</name>
                  <description>Running, CLK/8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_16</name>
                  <description>Running, CLK/16</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_32</name>
                  <description>Running, CLK/32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_64</name>
                  <description>Running, CLK/64</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_128</name>
                  <description>Running, CLK/128</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_256</name>
                  <description>Running, CLK/256</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_512</name>
                  <description>Running, CLK/512</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_1024</name>
                  <description>Running, CLK/1024</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_2048</name>
                  <description>Running, CLK/2048</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_4096</name>
                  <description>Running, CLK/4096</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_8192</name>
                  <description>Running, CLK/8192</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_16384</name>
                  <description>Running, CLK/16384</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM1A</name>
              <description>Compare Output Mode, Bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCONNECTED_FROM_OCN_PWMN</name>
                  <description>Disconnected from OCn/PWMn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OCN_PWMN_OUTPUT_LINE</name>
                  <description>Toggle OCn/PWMn output line</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OCN_PWMN_OUTPUT_LINE</name>
                  <description>Clear OCn/PWMn output line</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OCN_PWMN_OUTPUT_LINE</name>
                  <description>set OCn/PWMn output line</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM1A</name>
              <description>Pulse Width Modulator Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTC1</name>
              <description>Clear Timer/Counter on Compare Match</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT1</name>
          <description>Timer/Counter Register (read-only for debugger)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV1</name>
              <description>Timer/Counter1 Overflow Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF1B</name>
              <description>Timer/Counter1 Output Compare Flag 1B</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF1A</name>
              <description>Timer/Counter1 Output Compare Flag 1A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE1</name>
              <description>Timer/Counter1 Overflow Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE1B</name>
              <description>OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE1A</name>
              <description>OCIE1A: Timer/Counter1 Output Compare Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
